; domain
; IPC5 Domain: Trucks Propositional
; Authors: Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti 

(define (domain Trucks) 
(:requirements :typing :adl)  

(:types truckarea time location locatable - object
        truck package - locatable) 

(:predicates (at ?x - locatable ?l - location) 	     
             (in ?p - package ?t - truck ?a - truckarea) 	     
             (connected ?x ?y - location)
             (free ?a - truckarea ?t - truck)
  	     (time-now ?t - time)
 	     (next ?t1 - time ?t2 - time)
	     (le ?t1 - time ?t2 - time)
 	     (delivered ?p - package ?l - location ?t - time)
	     (at-destination ?p - package ?l - location)
 	     (closer ?a1 - truckarea ?a2 - truckarea))

(:action load
 :parameters (?p - package ?t - truck ?a1 - truckarea ?l - location)
 :precondition (and (at ?t ?l) (at ?p ?l) (free ?a1 ?t)
  		    (forall (?a2 - truckarea)
  			    (imply (closer ?a2 ?a1) (free ?a2 ?t))))
 :effect (and (not (at ?p ?l)) (not (free ?a1 ?t)) (in ?p ?t ?a1)))

(:action unload
 :parameters (?p - package ?t - truck ?a1 - truckarea ?l - location)
 :precondition (and (at ?t ?l) (in ?p ?t ?a1)
  		    (forall (?a2 - truckarea)
  			    (imply (closer ?a2 ?a1) (free ?a2 ?t))))
 :effect (and (not (in ?p ?t ?a1)) (free ?a1 ?t) (at ?p ?l)))

(:action drive
 :parameters (?t - truck ?from ?to - location ?t1 ?t2 - time)
 :precondition (and (at ?t ?from) (connected ?from ?to) 
		    (time-now ?t1) (next ?t1 ?t2))
 :effect (and (not (at ?t ?from)) (not (time-now ?t1)) 
	      (time-now ?t2) (at ?t ?to)))

(:action deliver
 :parameters (?p - package ?l - location ?t1 ?t2 - time)
 :precondition (and (at ?p ?l) (time-now ?t1) (le ?t1 ?t2))
 :effect (and (not (at ?p ?l)) (delivered ?p ?l ?t2) (at-destination ?p ?l)))

)

; problem
; Domain designed by Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem truck-631)
(:domain Trucks)
(:objects
	truck1 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	l1 - location
	l2 - location
	l3 - location
	l4 - location
	t0 - time
	t1 - time
	t2 - time
	t3 - time
	t4 - time
	t5 - time
	t6 - time
	t7 - time
	t8 - time
	t9 - time
	t10 - time
	t11 - time
	t12 - time
	a1 - truckarea
	a2 - truckarea)

(:init
	(at truck1 l4)
	(free a1 truck1)
	(free a2 truck1)
	(closer a1 a2)
	(at package1 l3)
	(at package2 l3)
	(at package3 l4)
	(at package4 l4)
	(at package5 l4)
	(connected l1 l2)
	(connected l1 l3)
	(connected l1 l4)
	(connected l2 l1)
	(connected l2 l3)
	(connected l2 l4)
	(connected l3 l1)
	(connected l3 l2)
	(connected l3 l4)
	(connected l4 l1)
	(connected l4 l2)
	(connected l4 l3)
	(time-now t0)
	(le t1 t1)
	(le t1 t2)
	(le t1 t3)
	(le t1 t4)
	(le t1 t5)
	(le t1 t6)
	(le t1 t7)
	(le t1 t8)
	(le t1 t9)
	(le t1 t10)
	(le t1 t11)
	(le t1 t12)
	(le t2 t2)
	(le t2 t3)
	(le t2 t4)
	(le t2 t5)
	(le t2 t6)
	(le t2 t7)
	(le t2 t8)
	(le t2 t9)
	(le t2 t10)
	(le t2 t11)
	(le t2 t12)
	(le t3 t3)
	(le t3 t4)
	(le t3 t5)
	(le t3 t6)
	(le t3 t7)
	(le t3 t8)
	(le t3 t9)
	(le t3 t10)
	(le t3 t11)
	(le t3 t12)
	(le t4 t4)
	(le t4 t5)
	(le t4 t6)
	(le t4 t7)
	(le t4 t8)
	(le t4 t9)
	(le t4 t10)
	(le t4 t11)
	(le t4 t12)
	(le t5 t5)
	(le t5 t6)
	(le t5 t7)
	(le t5 t8)
	(le t5 t9)
	(le t5 t10)
	(le t5 t11)
	(le t5 t12)
	(le t6 t6)
	(le t6 t7)
	(le t6 t8)
	(le t6 t9)
	(le t6 t10)
	(le t6 t11)
	(le t6 t12)
	(le t7 t7)
	(le t7 t8)
	(le t7 t9)
	(le t7 t10)
	(le t7 t11)
	(le t7 t12)
	(le t8 t8)
	(le t8 t9)
	(le t8 t10)
	(le t8 t11)
	(le t8 t12)
	(le t9 t9)
	(le t9 t10)
	(le t9 t11)
	(le t9 t12)
	(le t10 t10)
	(le t10 t11)
	(le t10 t12)
	(le t11 t11)
	(le t11 t12)
	(le t12 t12)
	(next t0 t1)
	(next t1 t2)
	(next t2 t3)
	(next t3 t4)
	(next t4 t5)
	(next t5 t6)
	(next t6 t7)
	(next t7 t8)
	(next t8 t9)
	(next t9 t10)
	(next t10 t11)
	(next t11 t12))

(:goal (and 
	(delivered package1 l2 t3)
	(delivered package2 l2 t3)
	(at-destination package3 l2)
	(delivered package4 l2 t6)
	(at-destination package5 l1)))



)

; plan
1. (load package3 truck1 a2 l4)
   deleted: (at package3 l4) (free a2 truck1)
   added: (in package3 truck1 a2)
   goals met: 0 of 5
2. (load package5 truck1 a1 l4)
   deleted: (at package5 l4) (free a1 truck1)
   added: (in package5 truck1 a1)
   goals met: 0 of 5
3. (drive truck1 l4 l1 t0 t1)
   deleted: (at truck1 l4) (time-now t0)
   added: (time-now t1) (at truck1 l1)
   goals met: 0 of 5
4. (unload package5 truck1 a1 l1)
   deleted: (in package5 truck1 a1)
   added: (free a1 truck1) (at package5 l1)
   goals met: 0 of 5
5. (drive truck1 l1 l3 t1 t2)
   deleted: (at truck1 l1) (time-now t1)
   added: (time-now t2) (at truck1 l3)
   goals met: 0 of 5
6. (unload package3 truck1 a2 l3)
   deleted: (in package3 truck1 a2)
   added: (free a2 truck1) (at package3 l3)
   goals met: 0 of 5
7. (load package1 truck1 a2 l3)
   deleted: (at package1 l3) (free a2 truck1)
   added: (in package1 truck1 a2)
   goals met: 0 of 5
8. (deliver package5 l1 t2 t10)
   deleted: (at package5 l1)
   added: (delivered package5 l1 t10) (at-destination package5 l1)
   goals met: 1 of 5
9. (load package2 truck1 a1 l3)
   deleted: (at package2 l3) (free a1 truck1)
   added: (in package2 truck1 a1)
   goals met: 1 of 5
10. (drive truck1 l3 l2 t2 t3)
   deleted: (at truck1 l3) (time-now t2)
   added: (time-now t3) (at truck1 l2)
   goals met: 1 of 5
11. (unload package2 truck1 a1 l2)
   deleted: (in package2 truck1 a1)
   added: (free a1 truck1) (at package2 l2)
   goals met: 1 of 5
12. (unload package1 truck1 a2 l2)
   deleted: (in package1 truck1 a2)
   added: (free a2 truck1) (at package1 l2)
   goals met: 1 of 5
13. (deliver package2 l2 t3 t3)
   deleted: (at package2 l2)
   added: (delivered package2 l2 t3) (at-destination package2 l2)
   goals met: 2 of 5
14. (deliver package1 l2 t3 t3)
   deleted: (at package1 l2)
   added: (delivered package1 l2 t3) (at-destination package1 l2)
   goals met: 3 of 5
15. (drive truck1 l2 l3 t3 t4)
   deleted: (at truck1 l2) (time-now t3)
   added: (time-now t4) (at truck1 l3)
   goals met: 3 of 5
16. (load package3 truck1 a2 l3)
   deleted: (at package3 l3) (free a2 truck1)
   added: (in package3 truck1 a2)
   goals met: 3 of 5
17. (drive truck1 l3 l4 t4 t5)
   deleted: (at truck1 l3) (time-now t4)
   added: (time-now t5) (at truck1 l4)
   goals met: 3 of 5
18. (load package4 truck1 a1 l4)
   deleted: (at package4 l4) (free a1 truck1)
   added: (in package4 truck1 a1)
   goals met: 3 of 5
19. (drive truck1 l4 l2 t5 t6)
   deleted: (at truck1 l4) (time-now t5)
   added: (time-now t6) (at truck1 l2)
   goals met: 3 of 5
20. (unload package4 truck1 a1 l2)
   deleted: (in package4 truck1 a1)
   added: (free a1 truck1) (at package4 l2)
   goals met: 3 of 5
21. (deliver package4 l2 t6 t6)
   deleted: (at package4 l2)
   added: (delivered package4 l2 t6) (at-destination package4 l2)
   goals met: 4 of 5
22. (unload package3 truck1 a2 l2)
   deleted: (in package3 truck1 a2)
   added: (free a2 truck1) (at package3 l2)
   goals met: 4 of 5
23. (deliver package3 l2 t6 t10)
   deleted: (at package3 l2)
   added: (delivered package3 l2 t10) (at-destination package3 l2)
   goals met: 5 of 5
